{"author":{"name":"Fishbat627","photo":"photo/a7098283-a579-407c-a8f9-9ff40db951d5.jpg"},"content":{"nodes":[{"heading":3,"id":"BzvxDDKymI","modified":1675995989419,"text":"<span>In the past, due to the ‘cliquey’ nature of the management team, almost all-important matters of BFBAN were decided by a small group of fixed people, which has led to many problems. From now on, we decide to reform the composition of our personnel to address the root of our problem. BFBAN will remain transparency to public and ensures our management team is fluidly formed and managed in a spirit of realism and enthusiasm for service.</span>"},{"children":[{"id":"WR7ONCJNP8","modified":1675995959486,"text":"<span class=\"italic\">All admin applicants’ ID will be shown on both BFBAN QQ group and official website while they are working as ‘no-staff’ member.</span>"},{"id":"8eXjdGvTqH","modified":1675995959486,"text":"<span class=\"italic\">Members of Cheating Identification Team (CIT) will have right to start proposals and vote only if they have processed certain number of cases.</span>"},{"id":"9TETIpXWv9","modified":1675995959486,"text":"<span class=\"italic\">After processing 5% of the total cases in their respective area, members of CIT will have access to voting rights on proposals related to Cheating Identification Guideline.</span>"},{"id":"cqZNIpsw3d","modified":1675995959486,"text":"<span class=\"italic\">Establish standing committee of CIT. It contains 7 members. Three of them are from Appeal Team and the four of them are from Web Report Processing Team.</span>"},{"id":"Js1hcwGyNg","modified":1675995959486,"text":"<span class=\"italic\">Web Report Processing Team consists four members. They are selected from web admins who have the most cases processed. At least one place in the Web Report Processing Team should be filled by member from each Battlefield tile.</span>"},{"id":"70qjAfuEys","modified":1675996157604,"text":"<span class=\"italic\">Appeal team consist 3 volunteers from the Standing Committee of current month. These three members will automatically re-elect as Standing Committee member for next month, They can be judge as slowdown through voting. If over half of the number in CIT vote yes, they will not be re-elected next month. At least one place in the Appeal Team should be filled by members from each Battlefield tile.</span>"},{"id":"n1xrGk7ys7","modified":1675996162893,"text":"<span class=\"italic\"> Members of CIT who have reached their monthly case processed goal will be able to vote for proposal related to Cheating Identification Guideline. However, only members of CIT standing committee have right to propose and vote on revised proposal for Personnel Rule or Conduct Rule and appeal related to violation punishment.</span>"},{"id":"j2MFbFmzBP","modified":1675996166080,"text":"<span class=\"italic\"> Standing members can initiate proposals twice a month for Personnel Rule and Conduct Rule and three times for Cheating Identification Guideline. If encounter major crisis, more proposal can be raised after the majority member from Development Team and Operation team agreed.</span>"}],"heading":3,"id":"dElPEcM0cE","modified":1675995959486,"text":"<span class=\"bold\">Cheating Identification Team </span><span class=\"bold\">recruit guideline</span><span>: </span><span class=\"italic\">see “BFBAN recruit guideline and </span><span class=\"italic\">‘</span><span class=\"italic\">non-staff’ position” </span><span class=\"italic\">https://www.mubucm.com/doc/50A69G68l4V</span>"},{"children":[{"id":"D4VXuKkgXd","modified":1675996177786,"text":"<span class=\"italic\"> Among members of Operation team, BFBAN Translator and Standing Operation Manager are nominated by Develop Team, voted on by Standing Committee of CIT and selected only after the Standing Committee has voted in favour.</span>"},{"id":"36dVadilst","modified":1675996180704,"text":"<span class=\"italic\"> Each month, depending on the current size of Operation Team, select 1-3 non-staff service member who are familiar to BFBAN’s operation process, has extended online time and good character to serve as Monthly Operation Team stuff. They act as reserve for Standing Operation Manager and process only supervision right,</span>"},{"id":"ZRBvIHg7mc","modified":1675996188567,"text":"<span> </span><span class=\"italic\">Operation Team can raise at most two proposals each month. If encountering critical crisis, more proposal can be raised after the majority member from Development Team and Standing Committee of CIT agreed.</span>"}],"heading":3,"id":"edNDtPzLON","modified":1675996024215,"text":"<span class=\"bold italic\">Operation Team Recruit Guideline:</span><span class=\"italic\"> Establishing a multi-sourced Operation Team with different recruitment criteria depending the position</span>"},{"children":[{"id":"8RDDbaR6ef","modified":1675996266481,"text":"<span class=\"italic\"> Development Team can raise up to two proposal each month. If encountering critical crisis, more proposal can be raised after the majority member from Operation Team and Standing Committee of CIT agreed. Additional one proposal can be raised by Development Team representing third-party partner platforms.</span>"},{"id":"dpC8SGGMEk","modified":1675996269194,"text":"<span class=\"italic\">Development Team can only raise new proposal on Personal Rule and Behaviour Guideline or vote for proposal related to these two.</span>"},{"id":"umqQIkSjb6","modified":1675996271726,"text":"<span class=\"italic\">Third-party development group can apply to join BFBAN management group to gain an insight into the organisation, but process no actual power.</span>"},{"id":"EoBwlhgzcc","modified":1675996274325,"text":"<span class=\"italic\">Third-party tool partner may designate at most one person to act as special development managers. They don’t have any real power of their own, but the development team may raise proposal related to Personnel Rule and Behaviour Guideline conducting on their behalf.</span>"}],"heading":3,"id":"sxafBBF9p3","modified":1675996263146,"text":"<span class=\"bold italic\">Development Team:</span><span class=\"italic\"> Currently setting up communication platform. If you would like to join, please contact the current Development Team.</span>"},{"children":[{"id":"ijWAUY0KLr","modified":1675995958049,"text":"<span class=\"italic\">For Cheat Identification Guideline, only the members of CIT have right to raise and vote for related proposal. Operation Team is only responsible for setting agenda and overseeing voting process. Development Team can’t interfere this process in any form.</span>"},{"id":"aAM3bZqV2T","modified":1675996138474,"text":"<span class=\"italic\">For Personal Rule and Behaviour Guideline, the vote weight is 5:3:3. CIT 5, Operation Team 3 and Development Team 3.</span>"}],"heading":3,"id":"xOJa14Y53i","modified":1675995959486,"text":"<span class=\"bold italic\">How the rules are being proposed and amended</span>"},{"children":[{"id":"JRmDdOjobi","modified":1675995958049,"text":"<span class=\"italic\">If a BFBAN member break rules, he or she will be judged by Operation Team. He or she is able to appeal when over half members from CIT Standing Committee or Development Team disagree with the result. In this case a vote will be hold with vote weight of1:1:1. CIT 1, Operation Team 1 and Development Team 1.</span>"},{"id":"gqkDLfQnFK","modified":1675996127881,"text":"<span class=\"italic\">Violation by member of Operation Team will result in a vote</span><span> </span><span class=\"italic\">with vote weight of1:1:1. CIT 1, Operation Team 1 and Development Team 1.</span>"}],"heading":3,"id":"3ynpBtAyuV","modified":1675995959486,"text":"<span class=\"bold italic\">Punishment for rule violation</span>"}]},"name":"Personnel Rule","date":"2023-2-10","time":1675996291905}