{"author":{"name":"Fishbat627","photo":"photo/a7098283-a579-407c-a8f9-9ff40db951d5.jpg"},"content":{"nodes":[{"heading":0,"id":"OInLpb7PYp","modified":1675996368773,"text":"<span class=\"bold\">As users and administrators of BFBAN website (</span><a class=\"content-link bold\" target=\"_blank\" spellcheck=\"false\" rel=\"noreferrer\" href=\"https://bfban.gametools.network/),\"><span class=\"content-link-text\">https://bfban.gametools.network/),</span></a><span class=\"bold\"> BFBAN members caused multiple incidents in the past few years by acting unprofessionally and using improper language. Those incidents inflicted tremendous damage to BFBAN. In order to improve the current situation and prevent similar incidents to happening again, we formulate the Code of Conduct (CoC) to regulate behavior and language used among members of BFBAN. We believe such act will strengthen our cohesion, encourage mutual supervision and, in the end, improve our reputation. . </span>"},{"children":[{"id":"mvywXhoNyy","modified":1675996412011,"text":"<span>When BFBAN members are at their work stations (BFBAN website and/or other platforms)dealing with BFBAN related affairs, they should respond objectively and politely and avoid using abusive language. Harsh-worded reply will be allowed if only the litigant fails to operate in accordance with the Complaint Norm and the Reporting Norm, and vexatious after BFBAN members have given objective and reasonable response.</span>"},{"id":"FtVtLxkNcm","modified":1675996424786,"text":"<span>BFBAN members should not use their identity to catch people’s attention in any personal work/affairs (communication, article, video, etc.) that is not related to BFBAN, including but not limited to using words such as “BFBAN member”.</span>"},{"id":"5qfG5DR9M5","modified":1675996433609,"text":"<span>BFBAN members are not allowed to speak on the premise that they are “BFBAN admin” in the game, nor in any other gaming groups (QQ, Kook, Discord, etc.) for none BFBAN-related matters.</span>"},{"id":"Od7fd7QIrL","modified":1675996439121,"text":"<span> It is prohibited for BFBAN members to harass or threaten other players under the name of BFBAN.</span>"},{"id":"gKaIGdJhx2","modified":1675996473438,"text":"<span>BFBAN members are not allowed to intervene private/community servers’ management or community related affairs on the premise of being  “BFBAN member”. (Note: special conditions do apply when the BFBAN member is part of the management team of that private/community server.)</span>"},{"id":"GnVidSc0DQ","modified":1675996481980,"text":"<span>It is prohibited for BFBAN members to use any form of cheat/exploit/bug that is listed in the </span><span class=\"bold italic underline\">BFBAN Anti-Cheat Ban Guidelines</span>"},{"id":"YKoWTdkGq5","modified":1675996496818,"text":"<span>It is prohibited for BFBAN members to instigate or instigate cheaters to perform any action that is listed in the </span><span class=\"bold italic underline\">BFBAN Anti-Cheat Ban Guidelines </span><span>in game, video, or stream to affect gameplay of clean players. BFBAN members need to draw a clear line with the cheating group and do not make any active contact.</span>"},{"id":"XoxFmFP0pl","modified":1675996517397,"text":"<span>BFBAN members are allowed to disclose the chat records in the member group, but they cannot include records related to private personal information of members in the member group or deliberately take them out of context.</span>"},{"id":"ZaZVxCcaWt","modified":1675996535360,"text":"<span>BFBAN’s official account on </span><a class=\"content-link\" target=\"_blank\" spellcheck=\"false\" rel=\"noreferrer\" href=\"http://bilibili.com\"><span class=\"content-link-text\">bilibili.com</span></a><span>: 联ban局(lian banju), is the official account managed by BFBAN at bilibili.com. And this account is used to publish relate documents, videos, decisions, etc. from BFBAN organization. It is prohibited for any BFBAN member from using the official account to publish any personal comment and related information.</span>"}],"heading":3,"id":"wkNCRQ2pZu","modified":1675996394517,"text":"<span>All members of BFBAN should follow rules below:</span>"},{"children":[{"id":"xZJ2QKLFQs","modified":1675996543692,"text":"<span class=\"bold\">Members of the Cheating Identification Team, or referred as the BFBAN admins by people outside the organization (a.k.a admin), are the main work force that identify cheaters and make judgments on the BFBAN website.</span>"},{"id":"BrMZMcKCTz","modified":1675996553656,"text":"<span>The account and password of admin should not be shared to others. It is prohibited to lend the account, or asked others to act on behalf of the manager.</span>"},{"id":"Ox4k0hu7Y0","modified":1675996563470,"text":"<span>It is prohibited for admins to cover up cheaters, judge players maliciously with personal emotions, or accept bribes. Judgments should be made in accordance with the relevant provisions of the </span><span class=\"bold underline\">BFBAN Anti-cheat Ban Guideline</span><span> and in light of the actual situation.</span>"},{"id":"QSuoZXyzGF","modified":1675996576112,"text":"<span>It is prohibited for managers to maliciously targeted at normal players who make formal appeals, or accept bribes in all appeals. All appeals should be handled in accordance with the relevant provisions of the </span><span class=\"bold underline\">BFBAN Anti-cheat Ban Guideline</span><span> and in light of the actual situation.</span>"},{"id":"X0TozzYkl5","modified":1675996585403,"text":"<span>During any judgment or appeal review, admins may encounters a situation where accurate judgment cannot be made by himself/herself. It is understandable to seek help from other admins for joint judgment under reasonable circumstances.</span>"},{"id":"PMcqOgJJWT","modified":1675996593543,"text":"<span>Admins should handle their relevant fields. They should not interfere with other admins and cases that are not relevant to themselves. In case of disputes, the judgment made by the dominant field manager shall prevail.</span>"},{"id":"6DaEUHQNwu","modified":1675996606450,"text":"<span>All admins should adopt the same standard rubric. It is prohibited for them to be hostile to any other admins in BFBAN-related work due to in-game conflict or other issues, thereby affecting the judgment results.</span>"},{"id":"UQkKoBnkDW","modified":1675996615940,"text":"<span>Admins who quit BFBAN due to various circumstances and will no longer work for related affairs for a long time should contact other admins in time to remove the BFBAN website jurisdiction.</span>"},{"id":"f5zlrJXM2s","modified":1675996626878,"text":"<span>When an admin is reported in a case, this case should be handed over to other manager for judgment and the reportee should not take action on his/her own case.</span>"},{"id":"pVHxNOQY5a","modified":1675996635485,"text":"<span>The Cheating Identification Team will not interfere with affairs of the Operation team and the Development Team if no rules are violated. If there is any dispute, it must be discussed before any decision is made.</span>"}],"heading":3,"id":"vedhKLSkzP","modified":1675996538950,"text":"<span class=\"bold\">Members of the cheating identification team should obey the followings:</span>"},{"children":[{"id":"HFJow8thmj","modified":1675996642741,"text":"<span class=\"bold\">Members of the Development Team of the BFBAN website (aka. The developers) are the most important personals who construct, maintain and operate the BFBAN website, and are the most important back force that guarantees the admins to perform their duty.</span>"},{"id":"zFsZtbdlcW","modified":1675996650713,"text":"<span>The developers shall abide by the various agreements formulated within the Development Team and supervise each other.</span>"},{"id":"7odNhSPDiY","modified":1675996656332,"text":"<span>The developers must guarantee the normal operation of the BFBAN website, and shall not engage in acts that disrupt the normal operation of the website.</span>"},{"id":"j6MQMS6BI1","modified":1675996660872,"text":"<span>It is prohibited for developers to disclose any personal information of BFBAN website  users.</span>"},{"id":"E8HWgNHWDx","modified":1675996666157,"text":"<span>It is prohibited for developers to modify content of the website and database in the sever without authorization due to personal emotions, personal grievances, etc.</span>"},{"id":"5cJtKN2hvs","modified":1675996673012,"text":"<span>The development team shall not interfere with the affairs of the Operation Team and the Cheating Identification Team if no rules are violated. If there is any dispute, it must be discussed before any decision is made.</span>"},{"id":"Ohl8QtsYIT","modified":1675996693129,"text":"<span>If a write-in interface with the save authority as the Cheating Identification Team is provided to third party, a formal report on its impact and results should be provided to the other two teams.</span>"}],"heading":3,"id":"TPhdQDvwWF","modified":1675996639515,"text":"<span class=\"bold\">Members of the Development Team should obey the followings:</span>"},{"children":[{"id":"ADhGg1BcaH","modified":1675996698503,"text":"<span class=\"bold\">Members of the operation team (aka. The operator) are the main executors of the daily operation of the BFBAN organization and other non-development and non-cheating-identification tasks.</span>"},{"id":"zbVLwZAM0C","modified":1675996708943,"text":"<span>The operation team shall not interfere with the affairs of the development team and the cheating identification team if no rules are violated. If there is any dispute, it must be discussed before any decision is made.</span>"},{"id":"bAbj4LudJD","modified":1675996719690,"text":"<span>Operator with proposal rights and voting rights need to perform corresponding responsibilities to maintain the operation of BFBAN. If they cannot perform their duties, they must release their power to other members.</span>"},{"id":"0E0gZIQ0xR","modified":1675996741839,"text":"<span>When the operator exercises his/her supervisory rights, language used should be polite and precise to avoid any unnecessary dispute within the organization. No charges should be made to any members who have not violated any rules.</span>"}],"heading":3,"id":"9kILhRnFrF","modified":1675996695928,"text":"<span class=\"bold\">Members of the operation team should obey the followings:</span>"},{"id":"yBl6FItaGt","modified":1675996800755,"text":"<span>This COC, as a regulation formulated by BFBAN, is a summary of past experiences and disturbances. If a member violates any of the rules mentioned above, please report with evidence.</span>"},{"id":"yxoUNrQocl","modified":1675996796592,"text":"<span>Depending on the evidence and the actual situation, incidents will be discussed, and violators will be publicize penalized by one or many of the following: warnings, probation with freezing of website management rights, and/or dismissed from website management.</span>"},{"id":"Nb5sUtCj30","modified":1675996770671,"text":"<span>As of a newly formed COC, there will be no further investigation of past incidents, only violations from the date(20220930) will be investigated.</span>"},{"id":"qeC1KOLuJb","modified":1675996769096,"text":"<span>The final interpretation of this COC belongs to BFBAN, and the final penalty decision will be made by BFBAN.</span>"}]},"name":"BFBAN Code of Conduct (CoC)","date":"2023-2-10","time":1675996866157}