{
  "disable": false,
  "child": [
    {
      "image": "https://s2.loli.net/2022/11/07/dfWZKFenJBAgDmS.jpg",
      "content": "",
      "contentLang": {
        "zh-CN": "玩家:战地风云5封禁了，战地风云1我继续游玩",
        "en-US": "Player1: Battlefield 5 is banned, Battlefield 1 I continue to play"
      }
    },
    {
      "content": "",
      "contentLang": {
        "zh-CN": "玩家1:开挂是不对的，玩家2: 开了咋了",
        "en-US": "Player 1: It's wrong to open. Player 2: Yes, so what?"
      }
    },
    {
      "content": "",
      "contentLang": {
        "zh-CN": "请选择你的发言:\n1.我绝对没开挂\n2.我有个朋友\n3.是我的表弟\n4.打不过就加入\n5.我可以不开但不能没有\n6.我买的号\n7.刷枪的\n8.我号被别人盗了\n9.玩的好就是挂？\n11.其实大家都开了只不过都不说而已\n12.不开不行，打不过\n13.战地一开的，战地五没开\n14.以前开的，现在不开了\n15.开挂自保\n16.我开挂只打对面的挂\n17.我开的小号\n18.官服开的，私服没开\n19.我这数据是开挂的？\n20.我也希望有个好点的环境\n21.我体验一下挂的感觉，我才知道啥是挂啊\n22.玩这游戏没开过挂？\n23.我一年前开过的，现在也算？\n24.反挂组织为什么不打卖挂的，生产外\n挂的，攻击我不是向弱者下手\n25.人家挂哥还能带我赢，咱们私服杈限\n管理\n员被狗叫还要黑我\n26.我最近好像辅助用大了，能帮我解一\n下吗，我不再用了\n27.我朋友在对面给我打的\n28.这挂我写的，不能用？\n29.我玩的这一把没有开\n30.不是用个宏 连点你们也没必要这样\n骂人吧\n31.难道，开了一次后面就不能玩了？\n32.我开挂我的错，我也就训练场玩玩，\n没影响任何人吧，还来人身攻击了\n33.能证明私服不开行吗\n34.不能因为这仅仅一次就永久禁止我无\n法参加bfv社区游戏了呀\n35.我不就是追着管理员杀吗\n36.我战地五开过挂，他今天把我战地一\n七封了",
        "en-US": "Please select your speech:\n1. I definitely didn't cheat\n2. I have a friend\n3. It's my cousin\n4. I'd join them rather die.\n5. I don't use cheat but I need to have one\n6. I bought the account\n7. Weapon farming\n8. My account has been stolen\n9. You accuse me cheating just because I'm too good?\n11. In fact, everyone is cheating, but they just pretend to be legit\n12. I can't beat them without cheat\n13. I cheated in BF1, not in BFV\n14. I used to cheat, but not anymore\n15. I cheat just to self defense\n16. I cheated just to kill cheaters\n17. It is my alt\n18. Cheated on DICE server, but not on community servers\n19. Does my data look like cheating?\n20. I also hope to have a better environment\n21. I will know how is cheating looks like only after I cheated\n22. Can you find anyone that has no cheated in BFV?\n23. I cheatd over a year ago, it still counts?\n24. Why does the anti-cheat not deal with cheat seller, but banned me, I'm just a player.\n25. Cheaters can bring me vitory, but community server admins only know how to ban me.\n26. I turn the cheats on too much, can I get unbanned? I will not use it anymore\n27. My friend helped me from the other side\n28. I wrote the cheat, why can't I use it?\n29. I didn't cheat in this round\n30. It's just a macro, why blame me?\n31. So there's no chance after the first time I use cheat?\n32. It is my mistakes to use cheat, I just used it on training field.\nIt didn't bother anyone, did it? Why blame me?\n33. Can I prove that I will not cheat on community servers?\n34. Just because I cheated once doesn't mean I should be banned forever from join the bfv community servers\n35. Didn't I just kill the admin so I got banned?\n36. I cheated in BFV, now I got banned in BF1?"
      }
    }
  ]
}
