{
    "author": {
        "name": "Fishbat627",
        "photo": "photo/0cb650e3-6602-41b9-bbdf-8338f7c1c8b9.jpg"
    },
    "content": {
        "nodes": [
            {
                "heading": 1,
                "id": "TaZXDhz5LJ",
                "modified": 1692347779963,
                "text": "<span class=\"bold italic underline\">BFBAN Anti-Cheat Ban Guidelines </span><span class=\"bold\">is owned by BFBAN and used by BFBAN Admins (a.k.a.the Admins). This guideline is to facilitate and standardized the judgements on the </span><span class=\"bold underline\">BFBAN </span><span class=\"bold\">website.</span>"
            },
            {
                "children": [
                    {
                        "id": "fFklKUJdIY",
                        "modified": 1692349015000,
                        "text": "<span class=\"bold\">Article 1.</span><span> Judgment by BFBAN website robot (Menhera 酱，Menhera-chan) serves as the benchmark case. Judgment from the BFV ROBOT can also be used as reference. (Most of the data threshold of the two robots are the same).</span>"
                    },
                    {
                        "id": "gNbDwRACaT",
                        "modified": 1692349010932,
                        "text": "<span class=\"bold\">Article 2.</span><span> Judgment should be comprehensive and based on actual gameplay, weapons, game understanding of the Admin and past cases.</span>"
                    },
                    {
                        "id": "2duxT7k12T",
                        "modified": 1692349007152,
                        "text": "<span class=\"bold\">Article 3.</span><span> Lifetime stat of kills for a single weapon needs to reach 50 kills to serve as evidence. If multiple weapons all shows abnormal lifetime stats, they can be considered as evidence even with kills less than 50.</span>"
                    },
                    {
                        "id": "xxEaFJMBaK",
                        "modified": 1692349004524,
                        "text": "<span class=\"bold\">Article 4.</span><span> For new BFV cases with evidence of abnormal weapon lifetime data only, the Admins should only follow up after it is being reported over 10 minutes and it has been identified byMenhera-chan.</span>"
                    },
                    {
                        "id": "IK6eAKSeyL",
                        "modified": 1692349000300,
                        "text": "<span class=\"bold\">Article 5. </span><span>For new BFV cases with evidence of abnormal weapon lifetime data only, but not identified by Menhera-chan, the first Admin can either give suspicious (needs self-prove) status or vote for confirmed cheater based on his/her understanding of the game (2 votes are needed from Admins, or 1 vote from senior Admin).</span>"
                    }
                ],
                "heading": 2,
                "id": "zYtjPUSUEA",
                "modified": 1692347623894,
                "text": "<span class=\"bold\">Chapter 1. Lifetime stats judge</span>"
            },
            {
                "children": [
                    {
                        "id": "WciMubR0mf",
                        "modified": 1692347726794,
                        "text": "<span>Judgement should be based on abnormal data for actual gameplays.</span>"
                    },
                    {
                        "id": "0157Axty2I",
                        "modified": 1692348990261,
                        "text": "<span class=\"bold\">Article 6.</span><span> Abnormal data from a single match cannot be used as the only evidence for judgement </span><span class=\"bold underline\">unless</span><span> the data from a single match is </span><span class=\"bold underline\">extraordinarily </span><span>far away from normal gameplay (‘extraordinarily’ can be based on Admins’ personal understanding).</span>"
                    },
                    {
                        "id": "qCWWjZQxrb",
                        "modified": 1692348987207,
                        "text": "<span class=\"bold\">Article 7.</span><span> The Admins should also recognize that gameplay is random and unpredictable, so that even normal players may have excellent single match data that way above their lifetime stat.</span>"
                    },
                    {
                        "id": "Hdb74J3fSA",
                        "modified": 1692348983108,
                        "text": "<span class=\"bold\">Article 8.</span><span> Judgments can be obtained from single match data and lifetime stat. Judgement cannot be obtained from </span><span class=\"bold underline\">one </span><span>single match data unless there are multiple single match data that do not match the player’s lifetime stat.</span>"
                    }
                ],
                "heading": 2,
                "id": "miKgpFgrdg",
                "modified": 1692347720421,
                "text": "<span class=\"bold\">Chapter 2. In-game stats judge</span>"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "heading": 0,
                                "id": "De6wtKVbTt",
                                "modified": 1692348637972,
                                "text": "<span>The Admin should judge and verify whether the picture is related to there ported person and its authenticity.</span>"
                            },
                            {
                                "id": "4NsRLxhN39",
                                "modified": 1692347909521,
                                "text": "<span>The Admin should judge based on the picture and lifetime stat.</span>"
                            }
                        ],
                        "id": "8mNKj7us8W",
                        "modified": 1692347883569,
                        "text": "<span class=\"bold\">Article 9.</span><span> Judgment based on the pictures provided by whistleblower..</span>"
                    },
                    {
                        "children": [
                            {
                                "id": "NpyhD1A9wc",
                                "modified": 1692347932729,
                                "text": "<span>The Admin should judge and verify whether the video is related to the reportedperson and its authenticity.</span>"
                            },
                            {
                                "id": "tTyxs1U6Qo",
                                "modified": 1692348972604,
                                "text": "<span>The Admin should judge based on the video, actual gameplay scenario and understanding of the game.</span>"
                            },
                            {
                                "id": "1nsfCTxy7L",
                                "modified": 1692347944822,
                                "text": "<span>The Admin should judge based on the video and lifetime stat.</span>"
                            },
                            {
                                "id": "Y7ad2YxCnA",
                                "modified": 1692348950144,
                                "text": "<span>If the video is from spectator, the Admin should judge based on the video,combined with the actual game play scenario, spectating nature, and considering factors such as spectating delays and spectating bugs comprehensively.</span>"
                            }
                        ],
                        "id": "L6KvOunCxE",
                        "modified": 1692347918576,
                        "text": "<span class=\"bold\">Article 10.</span><span> Judgement based on the videos provided by whistleblower.</span>"
                    }
                ],
                "heading": 2,
                "id": "gHubXZmr9y",
                "modified": 1692347834732,
                "text": "<span class=\"bold\">Chapter 3. Video, and static picture judge</span>"
            },
            {
                "children": [
                    {
                        "id": "OE4KQX3LSe",
                        "modified": 1692348939996,
                        "text": "<span class=\"bold\">Article 11.</span><span> Report based on chat history must include at lease 20 messages before and after (the key information cannot be deleted in the chat history, otherwise it will be considered as a false report.). Pictures, videos that contains defendant’s game id and hack-related information, or social media account that represent the defendant’s game id post any picture, videos that related to cheating, will be judged by the Admins. If social media account is hacked, detailed evidence must be showed for appeal. If it is difficult to prove the real social media account that is related to the game id, and the game id had been miss represented and post any cheat related information, the game id owner needs to MOSS self-prove his/her highest lifetime performance required by the Admins, and the account will be unlocked after 7 days if there’re no new issues arise.</span>"
                    },
                    {
                        "id": "kvZHCMMArT",
                        "modified": 1692348901711,
                        "text": "<span class=\"bold\">Article 12.</span><span> If the defendant is reported by tempering the chat records, pictures, videos, etc. and post them on social media/e-commerce platform. Appeals will only be accepted by the Admins after the defendant records the exact procedures of tempering in a video, and the reproduction in the video should be almost the same as the evidence. If a third party tampers the chat records, pictures, videos, etc. of the defendant, and posts them on social media/e-commerce platform that caused the defendant be reported, then the defendant should provide the original evidence to the Admins for appeal. (The effective date of this article is 2022.12.02. Confirmed Cheater that was confirmed before this date can appeal based on this article. This article is applicable to cases that have not been closed before this date. For case report time that is later than this date, but the incident happened earlier than this date, Admins should deal with the mat their discretion.)</span>"
                    }
                ],
                "heading": 2,
                "id": "CLTTb1APwE",
                "modified": 1692347971951,
                "text": "<span class=\"bold\">Chapter 4. Report based on chat history and e-commerce record.</span>"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "id": "ScXP58Kv7n",
                                        "modified": 1692348048172,
                                        "text": "<span>First ban under this article can be lifted on the same day.</span>"
                                    },
                                    {
                                        "id": "DzjWsOlJSB",
                                        "modified": 1692348061656,
                                        "text": "<span>Second ban under this article can be lifted after one week.</span>"
                                    },
                                    {
                                        "id": "ne26kH7mLX",
                                        "modified": 1692348066503,
                                        "text": "<span>Third ban under this article is permanent and will not be lifted. </span>"
                                    }
                                ],
                                "id": "qkUYjv0Q1m",
                                "modified": 1692348041483,
                                "text": "<span>Players banned under this article can negotiate with the Admins:</span>"
                            },
                            {
                                "id": "XHaxODz2II",
                                "modified": 1692348863316,
                                "text": "<span>Exploding the server/taking down a server with any feature that is not permitted by EA/DICE is considered cheating and will be permanently banned.</span>"
                            }
                        ],
                        "id": "Al1uV8a2U1",
                        "modified": 1692348866580,
                        "text": "<span class=\"bold\">Article 13. </span><span>The BFBAN organization decided to ban players who intentionally use game bugs that are vicious, seriously affect the game balance, and destroy the game experience of others.</span>"
                    }
                ],
                "heading": 2,
                "id": "sEnAMTItIE",
                "modified": 1692348079101,
                "text": "<span class=\"bold\">Chapter 5. About using vicious bugs and taking down servers.</span>"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "id": "V1goVBLzsn",
                                "modified": 1692348860443,
                                "text": "<span class=\"bold\">Mouse auto-clicker macro</span><span>: use of third-party software to achieve automatic mouse or keyboard clicks.</span>"
                            },
                            {
                                "id": "gaeH8bVSut",
                                "modified": 1692348858275,
                                "text": "<span class=\"bold\">Gun recoil suppress macro</span><span>: use of third-party software to automatically compensate gun recoil. </span>"
                            }
                        ],
                        "id": "u8H4RBGd50",
                        "modified": 1692348103635,
                        "text": "<span>Two types of mouse macros:</span>"
                    },
                    {
                        "id": "YRb3R9ICaf",
                        "modified": 1692348133575,
                        "text": "<span class=\"bold\">What to ban?</span>"
                    },
                    {
                        "id": "1IUbwSXLBV",
                        "modified": 1692348855907,
                        "text": "<span class=\"bold\">Article 14.</span><span> Auto-clicker can be used in many scenarios. The use of auto-clicker should be judged with actual game play situation and environment. For players who use the auto-clicker to automatically and continuously click on semi-automatic weapons, through self-expose, reported by others, record in MOSS and other evidence, will be banned.</span>"
                    },
                    {
                        "id": "Fw0AjXyory",
                        "modified": 1692348848204,
                        "text": "<span>It is necessary to verify that the player has used the auto-clicker on the semi-automatic weapon before making a judgement. Use of gun recoil suppress macro will results in ban once it proved by evidence.</span>"
                    }
                ],
                "heading": 2,
                "id": "g6AemfXFsk",
                "modified": 1692348093504,
                "text": "<span class=\"bold\">Chapter 6. About using mouse macros</span>"
            },
            {
                "children": [
                    {
                        "id": "hf4bgM4EEp",
                        "modified": 1692348188192,
                        "text": "<span class=\"bold\">Article 15.</span><span> Insufficient evidence should result in </span><span class=\"bold underline\">Invalid report</span><span>.</span>"
                    },
                    {
                        "id": "hjJTsuUSB2",
                        "modified": 1692348842335,
                        "text": "<span class=\"bold\">Article 16.</span><span> Insufficient evidence, but the player is highly suspicious. The first Admin that take the case, based on his/her judgement experience, can ask the player to perform MOSS self-prove within a time limit. The Admin also need to change the player status to </span><span class=\"bold underline\">Suspicious</span><span>.</span>"
                    },
                    {
                        "id": "AxCPeBq3j4",
                        "modified": 1692348837261,
                        "text": "<span class=\"bold\">Article 17.</span><span> The Admins can assign </span><span class=\"bold underline\">voted for confirmed cheater</span><span> only when the evidence is clear and sufficient.</span>"
                    },
                    {
                        "id": "AqgCD9JSXM",
                        "modified": 1692348228202,
                        "text": "<span class=\"bold\">Article 18.</span><span> When changing the status of a closed case, sufficient reasons must be justified.</span>"
                    },
                    {
                        "id": "9Iy1sGCepL",
                        "modified": 1692348834663,
                        "text": "<span class=\"bold\">Article 19.</span><span> If there are doubts about the Admin or the case itself is controversial, the defendant may request more Admin to be involved. And the opinions of the majority Admins shall prevail.</span>"
                    }
                ],
                "heading": 2,
                "id": "p7nZoqisHo",
                "modified": 1692348170098,
                "text": "<span class=\"bold\">Chapter 7. About how to make judgements, and how to deal with disputes.</span>"
            },
            {
                "children": [
                    {
                        "id": "5JqN3WhbBJ",
                        "modified": 1692348258241,
                        "text": "<span class=\"bold\">Article 20.</span><span> In case of reporting/self-proof evidence becomes invalid.</span>"
                    },
                    {
                        "id": "6vGcXF4kkA",
                        "modified": 1692348816723,
                        "text": "<span>After a successful report, if the reporting evidence is deleted or lost within half a year, the report will become an invalid report. The Admin should change the defendant status to </span><span class=\"bold underline\">Invalid report</span><span> until the reporter provides the evidence again.</span>"
                    },
                    {
                        "id": "ZoaxiWvkMH",
                        "modified": 1692348814679,
                        "text": "<span>After a successful self-proof, if the self-proof evidence is deleted or lost within one year, the appeal is deemed invalid. The Admin should change the defendant status to</span><span class=\"bold\"> </span><span class=\"bold underline\">Confirmed cheater until</span><span class=\"bold\"> </span><span>the defendant provides the self-proof again.</span>"
                    },
                    {
                        "id": "cYb7IjirsD",
                        "modified": 1692348812045,
                        "text": "<span>If either evidence becomes invalid, the Admin should follow the above mentioned process. If both the reporting and self-proof evidence become invalid at the same time, the Admin should change the defendant status to </span><span class=\"bold underline\">Invalid report</span><span>.</span>"
                    },
                    {
                        "id": "CKpY7JlcMI",
                        "modified": 1692348324799,
                        "text": "<span class=\"bold\">Article 21.</span><span> Standardized process of self-proof.</span>"
                    },
                    {
                        "id": "hyp9Id5Zg0",
                        "modified": 1692348807864,
                        "text": "<span class=\"bold\">21.1.</span><span> Self-proof should follow the principle of “same case same account”, that is, the account that submitted self-proof must be consistent with the account in the case. If the account in the self-proof is not consistent with the account in the report, Admin should assign </span><span class=\"bold underline\">Suspicious</span><span> to the case. (The effective date of this article is 2022.12.02. Confirmed cheater can appeal on their cases that was closed before this date. This article is applicable to cases that have not been closed before this date. Case reported after this date, but the time of incident is before this date, the Admin should deal with them at their discretion)</span>"
                    },
                    {
                        "id": "IQgTgzm9uw",
                        "modified": 1692348353050,
                        "text": "<span class=\"bold\">21.2.</span><span> Self-proof should contain the following: first-person view video (video resolution must notbe lower than 720p, must not be lower than 30fps, follows the same exact sequence stated in21.3.2), battlefieldtracker link, MOSS zip file (no rename/modification of the zip file, only uploadthe file). If any of the above requirements are missing or inconsistent, the original judgementshall be maintained.</span>"
                    },
                    {
                        "id": "K8JRfgrbjb",
                        "modified": 1692348799157,
                        "text": "<span class=\"bold\">21.3.</span><span> Players are prohibited from using computers with software that has similar functions as sandbox or recovery software, such as “Shadow System”, for self-proof. That is, during the self proof process, the relevant software should not be started, and MOSS record should not contain any relevant software and process records. (The effective date of this article is 2023.6.18.Confirmed cheaters can appeal on their cases that were closed before this date if this article is favored to them. This article is applicable to cases that have not been closed before this date.Case reported after this date, but the time of incident is before this date, the Admins should deal with them at their discretion)</span>"
                    },
                    {
                        "id": "CIllokNnNX",
                        "modified": 1692348375921,
                        "text": "<span class=\"bold\">21.4.</span><span> Self-proof procedure:</span>"
                    },
                    {
                        "id": "KJWioSZkYT",
                        "modified": 1692348384565,
                        "text": "<span class=\"bold\">21.4.1.</span><span> For cases with abnormal data, the defendant can check case on </span><a class=\"content-link\" target=\"_blank\" spellcheck=\"false\" rel=\"noreferrer\" href=\"http://bfban.com/\"><span class=\"content-link-text\">BFBAN.com</span></a><span> tounderstand the weapons that showing abnormal data, and contact the Admins on BFBAN.comor emails to obtain the corresponding self-proof requirements for all abnormal data weapon toproceed to self-proof.</span>"
                    },
                    {
                        "id": "wK1YIJdMRj",
                        "modified": 1692348402668,
                        "text": "<span class=\"bold\">21.4.2.</span><span> Sequence of self-proof recording:</span>"
                    },
                    {
                        "id": "xtzP3Sj55O",
                        "modified": 1692348411737,
                        "text": "<span>Start recording – start MOSS with </span><span class=\"bold\">BFV selected</span><span> – start BFV – self-proof – stop MOSS – stoprecording.</span>"
                    },
                    {
                        "id": "upja73JdZL",
                        "modified": 1692348743429,
                        "text": "<span class=\"bold text-color-red\">21.4.3.</span><span class=\" text-color-red\"> When the player has finished the self-proof procedure, and the majority of the Admins who review the case consider the self-proof is controversial, the player must follow stricter standards for self-proof. If the player uses mouse driver software during self-proof, it must be shown at the beginning of the self-proof video about whether macro(s) exist inside the software. If any macro exists, detailed explanation of its content, functionality, using scenarios are required, and the player needs to demonstration of the actual usage of the macro(s).</span>"
                    },
                    {
                        "id": "B1GfLQ5xv9",
                        "modified": 1692348763826,
                        "text": "<span class=\" text-color-red\">Stricter standard of MOSS self-proof process: start cellphone recording – computer start up –Open Task Manager – close all non-system processes – start computer recording– start MOSS with BFV selected – start BFV – Cellphone recording ends after entering BFV – self-proof gameplay until requirements fulfilled (no less than 10 min) – stop MOSS and present the generated zip file (name and size) – stop computer recording.</span>"
                    },
                    {
                        "id": "FE5djiv3oP",
                        "modified": 1692348463439,
                        "text": "<span class=\"bold\">Article 22.</span><span> About self-proof for abnormal weapon data.</span>"
                    },
                    {
                        "id": "FXKhIvwsfw",
                        "modified": 1692348485797,
                        "text": "<span class=\"bold\">22.1.</span><span> The specific self-proof standards are subjected to the Admin that process the appeal.</span>"
                    },
                    {
                        "id": "TM8MZi4KBo",
                        "modified": 1692348747240,
                        "text": "<span class=\"bold\">22.2.</span><span> The Admins should consider differences in play styles, different damage setting of the server, combine the weapon efficiency and the server type that the defendant has been playing for a long time to setup the self-proof requirements.</span>"
                    },
                    {
                        "id": "APE5BUbPR8",
                        "modified": 1692348754916,
                        "text": "<span>The Admins should consider both lifetime stats and game record on battlefieldtracker to find the damage multiplier of the server. In principle, abnormal data obtained from 200% damage server should be self-proved in 200% damage server , abnormal data obtained from 100% damage server should be self-proved in the 100% damage server.</span>"
                    },
                    {
                        "id": "GK0iVUy3ad",
                        "modified": 1692349043018,
                        "text": "<span class=\"bold\">22.3.</span><span> There is no limitation on self-proof maps for abnormal life stat weapon. Abnormal data from a single game or multiple games need to be self-proved in corresponding maps.</span>"
                    },
                    {
                        "id": "hp70rYCzaQ",
                        "modified": 1692348664941,
                        "text": "<span class=\"bold\">22.4.</span><span> Self-proof between different types of weapons cannot be used universally. For example, if both bolt-action sniper and semi-automatic rifles have abnormal data, then the player needs self-proof twice. The same applies to submachine guns, machine guns, and automatic rifles.(except special weapons, such as M30, Chauchat, Breda, etc)</span>"
                    },
                    {
                        "id": "NjZh4dK5eO",
                        "modified": 1692349045892,
                        "text": "<span class=\"bold\">Article 23.</span><span> About random events and bugs that may appear, exist, and happen by chance during a game, and how to self-proof a bug.</span>"
                    },
                    {
                        "id": "Vit59GarUR",
                        "modified": 1692349198589,
                        "text": "<span>It should be correctly understood and acknowledged that there might be accidental random events in the game due to various reasons, bugs that are not subjectively used by players, or abnormal kills (behaviors) caused by undiscovered game mechanisms. For kills and behaviors caused by undiscovered bugs, if currently known cheating software do not have this related function, the admin should give priority to </span><span class=\"bold underline\">Invalid report</span><span>. If it is known that cheating software has this related function, the defendant needs to reproduce the relevant bug, otherwise the appeal will not be accepted.(The effective date of this article is 2023.01.14. Confirmed cheater can appeal on their cases if this new article are beneficial to the player. This article is applicable to cases that have not been closed before this date. For case reported after this date, but the time of incident is before this date, the Admin should deal with them at their discretion)</span>"
                    },
                    {
                        "id": "guoFji5g1n",
                        "modified": 1692349103454,
                        "text": "<span class=\"bold text-color-red\">Article 24.</span><span class=\" text-color-red\"> Abnormal stat from power leveling or streamer boosting.</span>"
                    },
                    {
                        "children": [
                            {
                                "id": "FHwiGjJ5DF",
                                "modified": 1692349216419,
                                "text": "<span class=\" text-color-red\">If the account is judged as recent gameplay stats are </span><span class=\"bold underline text-color-red\">inconsistent with lifetime stats</span><span class=\" text-color-red\">,but the power leveling or streamer boosting transaction time, gameplay time, and power leveler/streamer lifetime stat do match, the Admins will give priority to vote for“invalid report” and add the actual player’s id and lifetime stats during this incident as comment.</span>"
                            },
                            {
                                "id": "KSzqIslEj0",
                                "modified": 1692349230824,
                                "text": "<span class=\" text-color-red\">If stats from one or more rounds of gameplay are judged as </span><span class=\"bold underline text-color-red\">abnormal stats</span><span class=\" text-color-red\">, the Admins need to confirm power leveling or streamer boosting transaction time, gameplay time. If the above information is confirmed, the power leveler/streamer needs to follow the self-proof procedure on the exact account that has been reported.</span>"
                            },
                            {
                                "id": "QdirIEHm10",
                                "modified": 1692349244880,
                                "text": "<span class=\" text-color-red\">If the account is judged as recent gameplay stats are inconsistent with lifetime stats, or the power leveling or streamer boosting transaction time, gameplay time does not match. The original judgement shall be maintained, and the power leveler/streamer should not be included in this case.</span>"
                            }
                        ],
                        "id": "WBBNwL812n",
                        "modified": 1692349126423,
                        "text": "<span class=\"bold text-color-red\">24.1.</span><span class=\" text-color-red\"> When the account with abnormal stat from power leveling or streamer boosting has been reported and labeled as confirmed hacker or suspicious, the player should contact BFBAN Cheating Identification Team to confirm the fact of the power leveling transaction with the Admin and provide evidence.</span>"
                    },
                    {
                        "id": "4YZepHpjlB",
                        "modified": 1692349274967,
                        "text": "<span class=\" text-color-red\">(The effective date of this article is 2023.6.18. Confirmed cheaters can appeal on their cases that were closed before this date if this article is favored to them. This article is applicable to cases that have not been closed before this date. Case reported after this date, but the time of incident is before this date, the Admin should deal with them at their discretion)</span>"
                    }
                ],
                "collapsed": false,
                "heading": 2,
                "id": "KLEnpCy3Se",
                "modified": 1692348250900,
                "text": "<span class=\"bold\">Chapter 8. About appeal</span>"
            },
            {
                "children": [
                    {
                        "id": "5mQYgfwHOl",
                        "modified": 1692349305899,
                        "text": "<span class=\"bold\">Article 25.</span><span> If there is clear evidence that the player actively used unpacked weapons on official DICE servers and community servers without passwords, the Admin should </span><span class=\"bold underline\">vote for confirmed cheater</span><span class=\"bold\">.</span>"
                    },
                    {
                        "id": "HIUqQSBIk8",
                        "modified": 1692349363694,
                        "text": "<span class=\"bold text-color-red\">Article 26.</span><span> In the above-mentioned servers and due to unknown reasons, if players passively holds unpacked weapon or weapon that does not exist in the map, or there is no evidence shows that player actively used such weapon, the Admin should check the player’s battflefieldtracker record. If there’s kill record based on such weapon </span><span class=\" text-color-red\">or extensive usage of unpacked equipment</span><span>, the Admin should </span><span class=\"bold underline\">vote for confirmed cheater</span><span>.</span>"
                    },
                    {
                        "id": "cxmbJBJ96L",
                        "modified": 1692349400210,
                        "text": "<span class=\"bold\">Article 27.</span><span> In the above-mentioned servers, if there’s video evidence shows the player obviously interacted with a cheater for exchanging weapons , the Admin should </span><span class=\"bold underline\">vote for confirmed cheater</span><span> and wait for the player to appeal.</span>"
                    },
                    {
                        "id": "QIIR1kQieG",
                        "modified": 1692349429136,
                        "text": "<span class=\"bold\">Article 28.</span><span> In the above-mentioned servers, if the player used a weapon that cannot be obtained from the map/server, the Admin should check and confirm whether the weapon used by the player can be obtained in such map/server. If not, the Admin should </span><span class=\"bold underline\">vote for confirmed cheater</span><span class=\"bold\">.</span>"
                    },
                    {
                        "id": "3w19DIvjvu",
                        "modified": 1692349446750,
                        "text": "<span>(The effective date of Chapter 9 is 2022.11.05. Confirmed cheater before this date can appeal based on this article. This article is applicable to cases that have not been closed before this date. For case report time that is later than this date, but the incident happened earlier than this date, Admins should deal with them at their discretion.)</span>"
                    }
                ],
                "heading": 2,
                "id": "rgtFVTdiw9",
                "modified": 1692349284495,
                "text": "<span class=\"bold\">Chapter 9. Handling cases related to the use of unpacked weapons.</span>"
            },
            {
                "children": [
                    {
                        "id": "ohb5gQwNrI",
                        "modified": 1692349590504,
                        "text": "<span class=\"bold\">Article 29.</span><span> If there is clear evidence that the player actively used unpacked weapons on official DICE servers and community servers without passwords, the appeal will not be accepted.</span>"
                    },
                    {
                        "id": "fM8wTWPpmv",
                        "modified": 1692349646923,
                        "text": "<span class=\"bold text-color-red\">Article 30.</span><span> In the above-mentioned servers and due to unknown reasons, if players passively holds unpacked weapon or weapon that does not exist in the map, or there is no evidence shows that player actively used such weapon, the Admin should check the player’s battflefieldtracker record. If an actual cheater is identified in the same game and the defendant does not have kill record based on such weapon, the Admin should change the defendant status to </span><span class=\"bold underline\">Invalid report</span><span>. If there’s kill record based on such weapon </span><span class=\" text-color-red\">or extensive usage of unpacked equipment</span><span>, the appeal will not be accepted.</span>"
                    },
                    {
                        "id": "DemCnq9f8Y",
                        "modified": 1692349732229,
                        "text": "<span class=\"bold text-color-red\">Article 31.</span><span class=\" text-color-red\"> </span><span>In the above-mentioned servers, if there’s video evidence shows the player obviously interacted with a cheater for exchanging weapons, the Admin should check the battlefieldtracker record. If there’s kill record based on such weapon </span><span class=\" text-color-red\">or extensive usage of unpacked equipment</span><span>, the appeal will not be accepted. If there’s no kill record based on such weapon </span><span class=\" text-color-red\">or no extensive usage of unpacked</span><span> </span><span class=\" text-color-red\">equipment</span><span>, the Admin should change the defendant status to </span><span class=\"bold underline\">Invalid report</span><span> after 3 days.</span>"
                    },
                    {
                        "id": "n1Q05yXeir",
                        "modified": 1692349780661,
                        "text": "<span class=\"bold\">Article 32.</span><span> In the above-mentioned servers, if the player used a weapon that cannot be obtained from the map/server. After the Admin verify that such weapon cannot be obtained from the map/server but the defendant refuse to accept such conclusion, the defendant has one month to reproduce the same incident in a video to prove himself/herself. If it reproduced successfully, the Admin should change the defendant status to </span><span class=\"bold underline\">Invalid report</span><span>; it not, the appeal will not be accepted and the original judgment will be upheld.</span>"
                    },
                    {
                        "id": "wsJs9DL8EX",
                        "modified": 1692349793016,
                        "text": "<span>(The effective date of Chapter 10 is 2022.11.05. Confirmed cheater before this date can appeal based on this article. This article is applicable to cases that have not been closed before this date. For case report time that is later than this date, but the incident happened earlier than this date, Admins should deal with them at their discretion.)</span>"
                    }
                ],
                "heading": 2,
                "id": "iWxmEVmUYf",
                "modified": 1692349568749,
                "text": "<span class=\"bold\">Chapter 10. Handling appeals of cases related to the use of unpacked weapons.</span>"
            },
            {
                "id": "aCBz5Ym8Pz",
                "modified": 1692349801861,
                "text": "<span class=\"bold\">This guideline is used by the BFBAN Cheating Identification Team (CIT). The Admins should supervise each other based on this guideline. Modified sections will be </span><span class=\"bold text-color-red\">marked in red</span><span class=\"bold\">.</span>"
            },
            {
                "id": "XH3ohIM9Os",
                "modified": 1692349813498,
                "text": "<span>The final interpretation right belongs to BFBAN. The final penalty decision is made by BFBAN.</span>"
            }
        ]
    },
    "name": "BFBAN Anti-Cheat Ban Guidelines",
    "date": "2023-8-18",
    "time": 1692349814251
}